{
  "story_id": "story-007",
  "shots": [
    {
      "id": "shot_01",
      "sequence": 1,
      "subject": "体型肥硕的短发青年，穿着破旧道袍，眼神迷茫",
      "detail": "2D Chinese anime style, a stout short-haired youth wearing a tattered Taoist robe, his eyes dazed and unfocused, first the glowing spirit stone in his palm softly illuminates his face, then gradually lights up his robe, finally revealing the silhouettes of distant mountain peaks; misty dawn at the foot of Lingjian Mountain, soft ambient light with subtle volumetric fog, horizontal pan shot; background sound: gentle wind rustling through pine trees and faint resonant hum of the spirit stone. Voiceover says in Chinese \"灵剑山下，一个平凡的少年。\"",
      "camera": "水平横移拍摄",
      "image_detail": "(2D国漫风格)，灵剑山山脚，晨雾缭绕，男主角俯身捡起一颗发光的灵石，背景是山峰轮廓，高清晰度，8K画质",
      "narration": "灵剑山下，一个平凡的少年。",
      "tone": "神秘",
      "image_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Ft2i%2Fshot_01%2Fkeyframe.png?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765448988&Signature=HwJKxSaq2ZeuLgvYIOfhvYqH5Lg%3D",
      "video_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Fi2v%2Fshot_01%2Ffinal.mp4?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765449092&Signature=%2FA0yk7ia2OPdjAMKTbShOiIbdEE%3D"
    },
    {
      "id": "shot_02",
      "sequence": 2,
      "subject": "身着金色长裙的女神，眉心有星芒，手持长剑",
      "detail": "2D Chinese anime style, a divine goddess wearing a golden long gown with a star-shaped mark glowing on her forehead and holding a radiant long sword, first the star mark on her forehead glows with soft stardust light, then the blade of the sword illuminates with shimmering silver-white radiance, finally the light expands to gently bathe the towering peak of Lingjian Mountain below, background features a flowing starry river across the cosmic sky, vertical dolly shot ascending smoothly from ground level up to eye level with the floating goddess, high-resolution 8K cinematic framing, sacred and awe-inspiring atmosphere. Background sound: gentle celestial hum with flowing starriver ambience and resonant sword chime. Voiceover says in Chinese \"天界女神降临，命运的齿轮开始转动。\"",
      "camera": "垂直升降拍摄",
      "image_detail": "(2D国漫风格)，灵剑山主峰，女神悬浮空中，脚下是山体，背景是星河，高清晰度，8K画质",
      "narration": "天界女神降临，命运的齿轮开始转动。",
      "tone": "神圣",
      "image_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Ft2i%2Fshot_02%2Fkeyframe.png?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765448988&Signature=vKd07qBzAmpepmsUuVzU7H1iMjs%3D",
      "video_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Fi2v%2Fshot_02%2Ffinal.mp4?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765449092&Signature=ySa3OMj8adw9tnRJr9PODvFwRzQ%3D"
    },
    {
      "id": "shot_03",
      "sequence": 3,
      "subject": "男主角在山巅修炼，满头大汗，但眼神坚定",
      "detail": "2D Chinese anime style, a determined young male protagonist meditating cross-legged on the peak of Lingjian Mountain, sweat glistening on his forehead and face, his eyes sharp and resolute; first the glowing spiritual energy illuminates his forehead, then expands to highlight the swirling qi vortex around his body, finally radiating outward to illuminate the vast sea of clouds below; ethereal spiritual energy swirls dynamically around him, soft volumetric lighting with gentle atmospheric glow, mist drifting through the clouds, high-resolution 8K cinematic detail; fixed camera framing, centered composition; background sound: howling mountain wind and subtle shimmering spiritual energy pulses. Voiceover says in Chinese \"他踏上修行之路，只为寻找真相。\"",
      "camera": "固定机位",
      "image_detail": "(2D国漫风格)，灵剑山巅，男主角盘腿打坐，周围环绕灵气，背景是云海，高清晰度，8K画质",
      "narration": "他踏上修行之路，只为寻找真相。",
      "tone": "奋斗",
      "image_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Ft2i%2Fshot_03%2Fkeyframe.png?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765448989&Signature=Zw5lUMRDC5pYNSZPqO4k3MQDAYg%3D",
      "video_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Fi2v%2Fshot_03%2Ffinal.mp4?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765449093&Signature=ZTwHfV54FBPRaV42xMP7WjTZeAM%3D"
    },
    {
      "id": "shot_04",
      "sequence": 4,
      "subject": "女神与男主角在山巅对决，剑光如虹",
      "detail": "2D Chinese anime style, a goddess and the male protagonist face off atop a mist-shrouded mountain peak, their swords drawn and clashing—first the goddess’s blade flares with blinding light, then the male lead’s long sword ignites in response, finally illuminating a shattered starry cosmos swirling behind them; dynamic sword sparks fly outward, wind whips their hair and robes, lightning cracks across the fractured heavens, subtle tremors ripple through the cliff edge; background features a cosmic battlefield with floating celestial shards and glowing ancient runes; camera orbits smoothly around the duo in a full 360-degree cinematic loop, emphasizing scale, tension, and symmetry; Background sound: sharp metallic sword ring blended with deep thunder rumbles. Voiceover says in Chinese \"命运的对决，爱恨交织。\"",
      "camera": "全方位环绕",
      "image_detail": "(2D国漫风格)，灵剑山巅，两人对峙，剑光交织，背景是破碎的星河，高清晰度，8K画质",
      "narration": "命运的对决，爱恨交织。",
      "tone": "激烈",
      "image_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Ft2i%2Fshot_04%2Fkeyframe.png?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765448990&Signature=P5dL3X08Cal%2FNPsH7oKhlt1UL80%3D",
      "video_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Fi2v%2Fshot_04%2Ffinal.mp4?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765449094&Signature=0159lyq3nZSaAcRKh6asi7bNF1A%3D"
    },
    {
      "id": "shot_05",
      "sequence": 5,
      "subject": "男主角在废墟中醒来，身边有女神的长剑",
      "detail": "2D Chinese anime style, melancholic atmosphere,男主角 wakes up in the ruins of Lingjian Mountain, lying on cracked ground with a broken divine sword beside him, first the faint starlight illuminates his sorrowful face, then glints off the fractured blade, finally revealing the shattered starry river stretching across the ruined sky; background wind howls and faint metallic rustling echoes from the corroded sword; camera locked on subject with subtle slow push-in; Background sound: howling wind and faint metallic rustling. Voiceover says in Chinese \"废墟之中，爱恨难断。\"",
      "camera": "锁定主体移动",
      "image_detail": "(2D国漫风格)，灵剑山废墟，男主角躺在地上，身边是断裂的长剑，背景是残破的星河，高清晰度，8K画质",
      "narration": "废墟之中，爱恨难断。",
      "tone": "悲怆",
      "image_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Ft2i%2Fshot_05%2Fkeyframe.png?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765448990&Signature=C3F3DQJ3DmogK2dStT%2FgetRwCQQ%3D",
      "video_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Fi2v%2Fshot_05%2Ffinal.mp4?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765449094&Signature=CATQA5%2BVYj41DCkvKmFIYiE2oDA%3D"
    },
    {
      "id": "shot_06",
      "sequence": 6,
      "subject": "女神现身废墟，两人对视，情感复杂",
      "detail": "2D Chinese anime style, a goddess descends gracefully onto the ruins of Lingjian Mountain, her serene yet sorrowful face illuminated first by faint starlight, then the starlight shifts to softly highlight the male protagonist's eyes filled with longing and conflict, finally revealing the shattered starry river in the background; the two stand motionless, locked in a charged, emotionally complex gaze—love and resentment intertwined, hearts pounding with unspoken feelings; dim ambient lighting with delicate celestial glow, subtle wind rustling through broken stone and distant cosmic hum; fixed camera framing the poignant confrontation in ultra-high-definition 8K resolution. Background sound: soft wind howling through ancient ruins and muffled, rhythmic heartbeat. Voiceover says in Chinese \"爱恨交织，情难自已。\"",
      "camera": "固定机位",
      "image_detail": "(2D国漫风格)，灵剑山废墟，女神降落，两人对视，背景是残破星河，高清晰度，8K画质",
      "narration": "爱恨交织，情难自已。",
      "tone": "深情",
      "image_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Ft2i%2Fshot_06%2Fkeyframe.png?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765448990&Signature=OZaZl8AFjBCec88j3Kw9MpSUu%2Fw%3D",
      "video_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Fi2v%2Fshot_06%2Ffinal.mp4?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765449095&Signature=egAC8D5W4RXlbNVZgt%2Fs092hg3o%3D"
    },
    {
      "id": "shot_07",
      "sequence": 7,
      "subject": "两人携手走向山巅，背影渐行渐远",
      "detail": "2D Chinese animation style, two figures walking hand-in-hand toward the mountain peak, their silhouettes gradually receding into the distance; first the rising sun illuminates their backs, then reveals the sharp contour of Lingjian Mountain’s summit, and finally bathes the entire dawn sky in golden light; horizontal tracking shot; background wind rustling and subtle heartbeat rhythm; Background sound: gentle wind rustling through mountain pines and soft, steady heartbeat. Voiceover says in Chinese \"爱恨终成过往，携手共赴未来。\"",
      "camera": "水平横移拍摄",
      "image_detail": "(2D国漫风格)，灵剑山巅，两人背对背行走，背景是朝阳，高清晰度，8K画质",
      "narration": "爱恨终成过往，携手共赴未来。",
      "tone": "希望",
      "image_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Ft2i%2Fshot_07%2Fkeyframe.png?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765448990&Signature=2kM7tt%2B59irtFxCEZzH83Lxqd1c%3D",
      "video_url": "http://bytedance-s2v.oss-cn-beijing.aliyuncs.com/story%2Fu-007%2Fstory-007%2Fi2v%2Fshot_07%2Ffinal.mp4?OSSAccessKeyId=LTAI5tSADQjYfXrA2WuoLbXy&Expires=1765449096&Signature=1063lsQx%2ByhOWg2UNNa0AJiGE8A%3D"
    }
  ]
}